CDiamondGit/stm32SpaceInvaders/src/main.c
/*
 * ============================================================================
 * 1. INCLUDES
 * ============================================================================
 */

#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <stm32f031x6.h>
#include <time.h>

#include "display.h"
#include "musical_notes.h"
#include "serial.h"
#include "platform.h"
#include "sound_setup.h"
#include "sound_engine.h"


/*
 * ============================================================================
 * 2. MACROS
 * ============================================================================
 */

/* --- Scoring / records --------------------------------------------------- */
// score increase value in easy,medium and hard mode
#define SCORE_INC_EASY 10
#define SCORE_INC_MED 15
#define SCORE_INC_HARD 20
#define MAX_RECORDS 5

/* --- Screen -------------------------------------------------------------- */
#define SCREEN_W 128
#define SCREEN_H 160

/* --- Player ship --------------------------------------------------------- */
#define SHIP_W 12
#define SHIP_H 12
#define SHIP_MIN_X 2                        // min x pos for ship
#define SHIP_MAX_X (SCREEN_W - SHIP_W - 2)  // max x pos for ship
#define SHIP_SPEED 2

/* --- Projectiles --------------------------------------------------------- */
#define BULLET_W 2
#define BULLET_H 2
#define BULLET_OFFSET_X 6   // x offset from ship pos to keep bullet in nozzle of ship
#define BULLET_OFFSET_Y 13  // y offset from ship pos to keep bullet in nozzle of ship
#define BULLET_SPEED 4
#define ALIEN_BULLET_SPEED 1
#define BULLET_COLOR 65287
#define ALIEN_BULLET_COLOR 57034

/* --- Alien formation ----------------------------------------------------- */
#define ALIEN_W 11
#define ALIEN_H 8
#define ALIEN_ROWS 3
#define ALIEN_COLS 5
#define ALIEN_GAP_X 11    /* horizontal gap between aliens          */
#define ALIEN_GAP_Y 5     /* vertical gap between aliens            */
#define ALIEN_ORIGIN_X 12 /* grid left edge at game start           */
#define ALIEN_ORIGIN_Y 20 /* grid top  edge at game start           */

// alien grid dimension
// width = no of cols * (total width of alien + Xgap) - Xgap
// height = no of rows * (total width of alien + Ygap) - Ygap
#define ALIEN_GRID_W \
  (ALIEN_COLS * (ALIEN_W + ALIEN_GAP_X) - ALIEN_GAP_X) /* 75 */
#define ALIEN_GRID_H \
  (ALIEN_ROWS * (ALIEN_H + ALIEN_GAP_Y) - ALIEN_GAP_Y) /* 34 */

/* Movement bounds for the grid origin (left edge of col-0) */
#define ALIEN_MIN_X 2
#define ALIEN_MAX_X (SCREEN_W - ALIEN_GRID_W - 2)

/* How many pixels the grid shifts per move tick, and ms between ticks */
#define ALIEN_STEP 5
#define ALIEN_MOVE_MS_EASY 1000
#define ALIEN_MOVE_MS_MED 500
#define ALIEN_MOVE_MS_HARD 200
/* decrease speeds up alien and increase to slow down */

/* Drop distance when hitting a wall (one alien row + gap) */
#define ALIEN_DROP (ALIEN_H + ALIEN_GAP_Y)

/* --- Enemy firing -------------------------------------------------------- */
// alien fire delay bounds
// randomly delays from min to max ms
#define ALIEN_FIRE_MIN_MS 800
#define ALIEN_FIRE_MAX_MS 3000

/* --- Main alien ---------------------------------------------------------- */
#define MAIN_ALIEN_W 22
#define MAIN_ALIEN_H 16
#define MAIN_ALIEN_Y 10
#define MAIN_ALIEN_MIN_DELAY 3000
#define MAIN_ALIEN_MAX_DELAY 6000
#define MAIN_ALIEN_MOVE_DELAY 30  // movement speed (lower = faster)

/* --- HUD ----------------------------------------------------------------- */
#define HUD_LINE_Y 144
#define HUD_LINE_COLOR 57351

/* --- Respawn system ------------------------------------------------------ */
#define ALIEN_RESPAWN_FLASH_MS 200
#define ALIEN_RESPAWN_MIN 4
#define ALIEN_RESPAWN_MAX 12

/* --- Splash screen / background visuals ---------------------------------- */
#define LBAR_X 10
#define LBAR_Y 100
#define LBAR_W 108
#define LBAR_H 15
#define LBAR_BACKGROUND 57351  // black (background)
#define LBAR_FILL 57351        // green
#define STAR_RED 63680
#define STAR_BLUE 1119
#define STAR_WHITE 65535

/*
 * ============================================================================
 * 3. TYPE DECLARATIONS
 * ============================================================================
 */

/* --- Core gameplay types ------------------------------------------------- */
typedef enum { 
  BULLET_READY, BULLET_FIRE 
} BulletState;
typedef struct {
  uint16_t x, y;
  uint16_t oldX, oldY;
} Transform;
typedef struct {
  Transform coords;
  uint16_t speed;
} Ship;
typedef struct {
  Transform coords;
  BulletState state;
  uint16_t speed;
} Bullet;

/* --- Score / record types ------------------------------------------------ */
typedef struct {
  char initials[4]; /* 3 letters + null terminator */
  uint32_t score;
} ScoreRecord;

/* --- Enemy / alien types ------------------------------------------------- */
typedef struct {
  Transform coords;
  uint16_t speed;
  int8_t dir;              // 1 = right, -1 = left
  uint8_t active;          // 0 = hidden, 1 = active
  uint32_t nextSpawnTime;  // when to appear
  uint32_t lastMoveTime;   // movement timing
} MainAlien;
typedef struct {
  int16_t offsetX, offsetY;       /* current grid offset from base positions */
  int16_t oldOffsetX, oldOffsetY; /* previous offset for dirty-rect erase */
  int8_t dirX;                    /* formation direction: +1 right, -1 left */
  uint32_t lastMoveTime;          /* timestamp of last movement tick */
  uint8_t status[ALIEN_ROWS][ALIEN_COLS]; /* 0 = alive, 1 = dead */
  uint16_t basePosX[ALIEN_COLS];          /* base X per column at offset zero */
  uint16_t basePosY[ALIEN_ROWS];          /* base Y per row at offset zero */
  int8_t earToggle;      /* alternates sprite frame each move tick */
  Bullet ab[ALIEN_COLS]; /* one bullet slot per column */
  uint32_t nextFireTime[ALIEN_COLS]; /* earliest time each column may fire */

  uint8_t nextStatus[ALIEN_ROWS]
                    [ALIEN_COLS]; /* staged next-frame status double-buffer */
  uint8_t respawning;     /* 1 while new-wave respawn sequence is active */
  uint8_t previewVisible; /* toggles incoming formation preview on/off */
  uint8_t flashStep;      /* counts flash steps during respawn preview */
  uint8_t redrawAll;      /* forces full grid repaint next render frame */
  uint32_t respawnTimer;  /* timestamp driving each respawn animation step */
} AlienGrid;

