CDiamondGit/stm32SpaceInvaders/src/main.c
/* --- Whole game state ---------------------------------------------------- */
typedef struct {
  Ship ship;
  Bullet bullet;
  AlienGrid aliens;
  int lives;
  int score;
  int highScore;
  int alienSpeed;
  int score_inc;
  MainAlien mysteryAlien;
} GameState;

/* --- App / gameplay state types ------------------------------------------ */
typedef enum { MAINMENU, PLAYING, HELP, RECORD, MODE } AppState;
typedef enum { GAMERUNNING, PAUSE, GAMEOVER } PlayingState;
typedef enum { EASY, MEDIUM, HARD } GameMode;

/*
 * ============================================================================
 * 4. FUNCTION PROTOTYPES
 * ============================================================================
 */

/* --- Random / utility helpers -------------------------------------------- */
uint32_t xorshift32(void);
static uint8_t shouldFire(uint8_t threshold);
static uint32_t randomFireDelay(void);
static uint32_t randomMainAlienDelay(void);
uint8_t get_random_bit(uint32_t* state);
int isInside(uint16_t x1, uint16_t y1, uint16_t w, uint16_t h, uint16_t px, uint16_t py);

/* --- Background / screen helpers ----------------------------------------- */
void loadBackground(void);
void clearDisplay(void);
static void splashScreen(void);
static void makeBackground(int starCount);
static void printAscii(void);

/* --- Game initialisation / reset ----------------------------------------- */
static void parkAlienBullet(int col);
static void initAlienGrid(void);
static void initGameState(void);
static void resetGame(void);

/* --- Alien respawn system ------------------------------------------------ */
static void buildRandomAlienPattern(void);
static void startAlienRespawn(void);
static void applyAlienRespawnPattern(void);
static void updateAlienRespawn(uint32_t now);

/* --- Menu / app state screens -------------------------------------------- */
void mainMenu(AppState* as);
void help(AppState* as);
void getPause(PlayingState* ps, AppState* as);
void playing(AppState* as);
void showScoreBoard(AppState* as);
void selectMode(AppState* as, GameMode* gm);

/* --- Input handling ------------------------------------------------------ */
static void handleInput(PlayingState* ps, AppState* as);

/* --- Alien movement / firing --------------------------------------------- */
static int isAlienGridMt(void);
static uint16_t getLowestAlienY(void);
static void moveAliens(uint32_t now);
static void updateAlienFire(uint32_t now);
static void moveMainAlien(MainAlien* ma);

/* --- Collision / bullet state -------------------------------------------- */
static int checkCollision(uint16_t o1X, uint16_t o1Y, uint16_t o1w, uint16_t o1h, uint16_t o2X, uint16_t o2Y, uint16_t o2w, uint16_t o2h);
static void resetAlienBullet(int col);
static void resetPlayerBullet(void);
static void repairAliensUnderRect(uint16_t rx, uint16_t ry, uint16_t rw, uint16_t rh);
static int updateAlienBulletCollision(void);
static void updatePlayerCollision(void);
static int checkGameOver(void);
static void updateMainAlienBulletCollision(void);

/* --- Rendering ----------------------------------------------------------- */
static void renderAliens(void);
static void renderShip(void);
static void renderPlayerBullet(void);
static void renderAlienBullets(void);
static void renderScene(void);
static void renderStats(void);
static void renderGameOverScreen(PlayingState* ps, AppState* as);

/*
 * ============================================================================
 * 5. GLOBAL DECLARATIONS
 * ============================================================================
 */

/* --- Timing / frame control ----------------------------------------------- */
static uint32_t lastUpdate = 0;
static const uint32_t FRAME_DELAY = 16;  // 1000ms / 16 ms ~ 60 fps
// decrease to increase fps
// for eg if set to 8 => 1000ms / 8ms ~ 120 (display cant handle)
// in other words in a 1 second(1000 ms) 60 frames will be rendered if delay
// between frame is set to 16 ms so in code it can be used as, if difference
// between current and last updated time is less than FRAME_DELAY halt
// everything

/* --- App / mode state ----------------------------------------------------- */
AppState currentAppState = MAINMENU;
GameMode currentGameMode = EASY;

/* --- Core game state ------------------------------------------------------ */
static GameState gs;
static uint32_t randState;

/* --- High score records --------------------------------------------------- */
static ScoreRecord records[MAX_RECORDS] = {{"___", 0000}, {"___", 0000}, {"___", 0000}, {"___", 0000}, {"___", 0000},};

/* --- Sound Effects -------------------------------------------------------- */
const uint32_t shoot_notes[3] = {D5, D4, D5};
const uint32_t shoot_times[3] = {80, 100, 80};
const uint32_t shoot_note_count = 3;

const uint32_t explode_notes[11] = {F4, D4, C4, A3, F3, D3, C3, A2, F2, D2, C2};
const uint32_t explode_times[11] = {20, 20, 25, 25, 30, 35, 35, 40, 40, 45, 55};
const uint32_t explode_note_count = 11;

const uint32_t enter_game_notes_ch1[3] = {C3, D3, G3};
const uint32_t enter_game_times_ch1[3] = {150, 150, 150};
const uint32_t enter_game_note_count_ch1 = 3;

const uint32_t enter_game_notes_ch2[3] = {C6, D6, G6};
const uint32_t enter_game_times_ch2[3] = {150, 150, 150};
const uint32_t enter_game_note_count_ch2 = 3;

const uint32_t game_loop_notes[768] = { REST,G5,  A5,  AS5_Bb5, A5,  F5,  A5,  G5, REST,G5,  A5,  AS5_Bb5, C6,  AS5_Bb5, A5,  G5, REST,G5,  A5,  AS5_Bb5, A5,  F5,  A5,  G5, D6,  REST,C6,  REST,AS5_Bb5, A5,  AS5_Bb5, C6, F6,  REST,REST,G5,  D5,  D6,  D5,  C6, D5,  AS5_Bb5, D5,  A5,  D5,  AS5_Bb5, D5,  A5, D5,  G5,  D5,  A5,  D5,  AS5_Bb5, D5,  C6, D5,  AS5_Bb5, D5,  A5,  D5,  F5,  D5,  A5, D5,  G5,  D5,  G5,  D5,  D6,  D5,  C6, D5,  AS5_Bb5, D5,  A5,  D5,  AS5_Bb5, D5,  A5, D5,  AS5_Bb5, D5,  A5,  D5,  AS5_Bb5, D5,  C6, D5,  AS5_Bb5, D5,  A5,  D5,  F5,  D5,  A5, D5,  G5,  D5,  G5,  D5,  D6,  D5,  C6, D5,  AS5_Bb5, D5,  A5,  D5,  AS5_Bb5, D5,  A5, D5,  G5,  D5,  A5,  D5,  AS5_Bb5, D5,  C6, D5,  AS5_Bb5, D5,  A5,  D5,  F5,  D5,  A5, D5,  G5,  D5,  AS5_Bb5, D5,  D6,  D5,  C6, D5,  AS5_Bb5, D5,  A5,  D5,  AS5_Bb5, D5,  A5, D5,  G5,  D5,  A5,  D5,  AS5_Bb5, D5,  C6, D5,  AS5_Bb5, D5,  A5,  D5,  F5,  D5,  A5, D5,  G5,  D5,  C6,  C6,  F6,  D6,  REST, REST,REST,C6,  AS5_Bb5, C6,  F6,  D6,  C6, AS5_Bb5, C6,  F6,  D6,  REST,REST,REST,C6, D6,  DS6_Eb6, F6,  D6,  REST,DS6_Eb6, REST,C6, F6,  D6,  REST,REST,REST,C6,  AS5_Bb5, C6, F6,  D6,  C6,  AS5_Bb5, C6,  F6,  D6,  REST, REST,REST,C6,  D6,  DS6_Eb6, F6,  D5,  FS5_Gb5, F5,  A5,  A5,  G5,  A5,  G5,  A5,  G5, AS5_Bb5, A5,  G5,  F5,  A5,  G5,  D5,  A5, G5,  D5,  A5,  G5,  D5,  AS5_Bb5, C6,  A5, AS5_Bb5, G5,  D5,  D6,  D5,  C6,  D5,  AS5_Bb5, D5,  A5,  D5,  AS5_Bb5, D5,  A5,  D5,  G5, D5,  A5,  D5,  AS5_Bb5, D5,  C6,  D5,  AS5_Bb5, D5,  A5,  D5,  F5,  D5,  A5,  D5,  G5, D5,  G5,  D5,  D6,  D5,  C6,  D5,  AS5_Bb5, D5,  A5,  D5,  AS5_Bb5, D5,  A5,  D5,  AS5_Bb5, D5,  A5,  D5,  AS5_Bb5, D5,  C6,  D5,  AS5_Bb5, D5,  A5,  D5,  F5,  D5,  A5,  D5,  G5, D5,  G5,  D5,  D6,  D5,  C6,  D5,  AS5_Bb5, D5,  A5,  D5,  AS5_Bb5, D5,  A5,  D5,  G5, D5,  A5,  D5,  AS5_Bb5, D5,  C6,  D5,  AS5_Bb5, D5,  A5,  D5,  F5,  D5,  A5,  D5,  G5, D5,  AS5_Bb5, D5,  D6,  D5,  C6,  D5,  AS5_Bb5, D5,  A5,  D5,  AS5_Bb5, D5,  A5,  D5,  G5, D5,  A5,  D5,  AS5_Bb5, D5,  C6,  D5,  AS5_Bb5, D5,  A5,  D5,  F5,  D5,  A5,  D5,  G5, D5,  C6,  C6,  F6,  D6,  REST,REST,REST, C5,  REST,A4,  AS4_Bb4, C5,  D6,  G4,  AS4_Bb4, G4,  C5,  G4,  D6,  G4,  C6,  F4,  A4, F4,  F5,  F4,  D6,  DS4_Eb4, D6,  REST,E4, F4,  GS4_Ab4, REST,AS4_Bb4, REST,DS5_Eb5, GS4_Ab4, B4, GS4_Ab4, CS5_Db5, GS4_Ab4, DS5_Eb5, GS4_Ab4, CS5_Db5, FS4_Gb4, AS4_Bb4, FS4_Gb4, FS5_Gb5, FS4_Gb4, DS5_Eb5, E5,  D5,  REST,CS5_Db5, REST,AS4_Bb4, B4,  CS5_Db5, DS5_Eb5, GS4_Ab4, B4,  GS4_Ab4, CS5_Db5, GS4_Ab4, DS5_Eb5, GS4_Ab4, CS5_Db5, FS4_Gb4, AS4_Bb4, FS4_Gb4, FS5_Gb5, FS4_Gb4, DS5_Eb5, E5,  DS5_Eb5, REST,DS5_Eb5, E5, FS5_Gb5, CS5_Db5, E5,  CS4_Db4, DS5_Eb5, E5,  G5,  AS5_Bb5, GS5_Ab5, DS5_Eb5, DS6_Eb6, DS5_Eb5, CS6_Db6, DS5_Eb5, B5,  DS5_Eb5, AS5_Bb5, DS5_Eb5, B5,  DS5_Eb5, AS5_Bb5, DS5_Eb5, GS5_Ab5, DS5_Eb5, AS5_Bb5, DS5_Eb5, B5,  DS5_Eb5, CS6_Db6, DS5_Eb5, B5,  DS5_Eb5, AS5_Bb5, DS5_Eb5, FS5_Gb5, DS5_Eb5, AS5_Bb5, DS5_Eb5, GS5_Ab5, DS5_Eb5, GS5_Ab5, DS5_Eb5, DS6_Eb6, DS5_Eb5, CS6_Db6, DS5_Eb5, B5,  DS5_Eb5, AS5_Bb5, DS5_Eb5, B5,  DS5_Eb5, AS5_Bb5, DS5_Eb5, GS5_Ab5, DS5_Eb5, AS5_Bb5, DS5_Eb5, B5,  DS5_Eb5, CS6_Db6, DS5_Eb5, B5,  DS5_Eb5, AS5_Bb5, DS5_Eb5, FS5_Gb5, DS5_Eb5, AS5_Bb5, DS5_Eb5, GS5_Ab5, DS5_Eb5, GS5_Ab5, DS5_Eb5, DS6_Eb6, DS5_Eb5, CS6_Db6, DS5_Eb5, B5,  DS5_Eb5, AS5_Bb5, DS5_Eb5, B5,  DS5_Eb5, AS5_Bb5, DS5_Eb5, GS5_Ab5, DS5_Eb5, AS5_Bb5, DS5_Eb5, B5,  DS5_Eb5, CS6_Db6, DS5_Eb5, B5,  DS5_Eb5, AS5_Bb5, DS5_Eb5, FS5_Gb5, DS5_Eb5, AS5_Bb5, DS5_Eb5, GS5_Ab5, DS5_Eb5, GS5_Ab5, DS5_Eb5, DS6_Eb6, DS5_Eb5, CS6_Db6, DS5_Eb5, B5,  DS5_Eb5, AS5_Bb5, DS5_Eb5, B5,  DS5_Eb5, AS5_Bb5, DS5_Eb5, GS5_Ab5, DS5_Eb5, AS5_Bb5, DS5_Eb5, B5,  DS5_Eb5, CS6_Db6, DS5_Eb5, B5,  DS5_Eb5, AS5_Bb5, DS5_Eb5, FS5_Gb5, DS5_Eb5, AS5_Bb5, DS5_Eb5, GS5_Ab5, DS5_Eb5, CS6_Db6, FS6_Gb6, DS6_Eb6, REST,REST,REST,CS6_Db6, B5, CS6_Db6, FS6_Gb6, DS6_Eb6, CS6_Db6, B5,  CS6_Db6, FS6_Gb6, DS6_Eb6, REST,REST,REST,CS6_Db6, B5,  E6,  F6,  DS6_Eb6, REST,E6,  REST,REST,CS6_Db6, FS6_Gb6, DS6_Eb6, REST, REST,REST,CS6_Db6, B5,  CS6_Db6, FS6_Gb6, DS6_Eb6, CS6_Db6, B5,  CS6_Db6, FS6_Gb6, DS6_Eb6, REST,REST,REST,CS5_Db5, DS5_Eb5, E5,  F5,  DS5_Eb5, G5,  GS5_Ab5, AS5_Bb5, AS5_Bb5, GS5_Ab5, AS5_Bb5, GS5_Ab5, AS5_Bb5, GS5_Ab5, B6,  AS5_Bb5, GS5_Ab5, FS5_Gb5, AS5_Bb5, GS6_Ab6, DS5_Eb5, AS5_Bb5, GS6_Ab6, DS5_Eb5, AS5_Bb5, GS6_Ab6, DS5_Eb5, B5,  CS6_Db6, AS5_Bb5, B5,  GS5_Ab5, REST, REST};
const uint32_t game_loop_times[768] = { 417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 208, 208, 417, 417, 417, 208, 208, 208, 208, 417, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 208, 104, 208, 417, 104, 104, 312, 312, 625, 208, 208, 208, 104, 208, 104, 208, 417, 208, 208, 312, 312, 312, 104, 208, 208, 208, 104, 208, 104, 208, 417, 208, 208, 312, 312, 625, 208, 208, 208, 104, 208, 104, 208, 417, 208, 208, 312, 312, 208, 208, 208, 208, 312, 625, 312, 625, 312, 625, 208, 208, 208, 208, 312, 312, 208, 312, 312, 208, 312, 312, 208, 417, 417, 417, 417, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 208, 52,  52,  52,  52,  104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 417, 417, 208, 208, 156, 156, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 208, 104, 104, 208, 208, 208, 208, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 417, 417, 208, 208, 156, 156, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 417, 208, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 208, 104, 208, 104, 208, 417, 208, 208, 312, 312, 625, 208, 208, 208, 104, 208, 104, 208, 417, 208, 208, 312, 312, 312, 104, 104, 208, 104, 208, 104, 208, 417, 208, 208, 312, 312, 625, 208, 208, 208, 104, 208, 104, 208, 417, 208, 208, 312, 312, 208, 208, 208, 208, 312, 312, 312, 312, 208, 208, 104};
const uint32_t game_loop_note_count = 768;

