CDiamondGit/stm32SpaceInvaders/src/main.c
/*
 * ============================================================================
 * 7. MAIN
 * ============================================================================
 */

int main(void) {
  /* Hardware */
  initClock();
  initSysTick();
  setupIO();
  initSerial();
  initSound();
  initSound2();

  splashScreen();
  // Game Begins
  while (1) {
    // Switch statement for our Game State
    switch (currentAppState) {
      case MAINMENU:
        mainMenu(&currentAppState);
        break;
      case HELP:
        help(&currentAppState);
        break;
      case PLAYING:
        printAscii();

        start_sound_effect_ch1(enter_game_notes_ch1, enter_game_times_ch1,
                               enter_game_note_count_ch1, 0);
        start_sound_effect_ch2(enter_game_notes_ch2, enter_game_times_ch2,
                               enter_game_note_count_ch2, 0);
        delay(500);
        playing(&currentAppState);
        delay(100);
        break;
      case RECORD:
        showScoreBoard(&currentAppState);
        break;
      case MODE:
        delay(500);
        selectMode(&currentAppState, &currentGameMode);
        break;
      default:
        break;
    }
  }

  return 0;
}

/*
 * ============================================================================
 * 8. FUNCTION DEFINITIONS
 * ============================================================================
 */

/* --- Random / utility helpers -------------------------------------------- */
uint32_t xorshift32() {
  randState ^= randState << 13;
  randState ^= randState >> 17;
  randState ^= randState << 5;
  return randState;
}
static uint8_t shouldFire(uint8_t threshold) {
  return (xorshift32() % threshold) ==
         0;  // threshold => more higher less likely to fire
  /*
  threshold = 3:
  possible results of % 3 → { 0, 1, 2 }
  only 0 returns 1 → 1 in 3 chance = 33%
  */
}
static uint32_t randomFireDelay(void) {
  uint32_t range = ALIEN_FIRE_MAX_MS - ALIEN_FIRE_MIN_MS;
  return ALIEN_FIRE_MIN_MS + (xorshift32() % range);
}
static uint32_t randomMainAlienDelay(void) {
  uint32_t range = MAIN_ALIEN_MAX_DELAY - MAIN_ALIEN_MIN_DELAY;
  return MAIN_ALIEN_MIN_DELAY + (xorshift32() % range);
}
uint8_t get_random_bit(uint32_t* state) {
  (void)state;
  return xorshift32() & 1u;
}
int isInside(uint16_t x1, uint16_t y1, uint16_t w, uint16_t h, uint16_t px, uint16_t py) {
  return (px >= x1 && px <= x1 + w && py >= y1 && py <= y1 + h) ? 1 : 0;
}

/* --- Background / screen helpers ----------------------------------------- */
void loadBackground() {
  makeBackground(40);
  printTextBold("Space", 10, 10, 1, 0);
  printTextBold("Invader", 40, 20, 1, 0);

  putImage(20, 20, 11, 8, greenAlien[0], 1, 0);
  putImage(80, 10, 11, 8, greenAlien[1], 1, 0);
  for (int i = 0; i < 7; i++) {
    const uint16_t* spr = (i % 3 == 0)   ? redAlien[i % 2]
                          : (i % 3 == 1) ? greenAlien[i % 2]
                                         : blueAlienBoth[i % 2];
    putImage(i * 18, 145, 11, 8, spr, i % 2, 0);
  }
  // putImage(110, 0, 128,50, bottom_background, 1, 0);
}
void clearDisplay() {
  fillRectangle(0, 0, SCREEN_W, SCREEN_H, 0);
}
/*
 * Serial output function:
 * Print hello world
 */
static void printAscii(void) {
  eputs("\r\nGood luck! You'll need it.\r\n");
  eputs("\r\n    @@          @@    \r\n");
  eputs("\r\n      @@      @@      \r\n");
  eputs("\r\n    @@@@@@@@@@@@@@    \r\n");
  eputs("\r\n  @@@@  @@@@@@  @@@@  \r\n");
  eputs("\r\n@@@@@@@@@@@@@@@@@@@@@@\r\n");
  eputs("\r\n@@  @@@@@@@@@@@@@@  @@\r\n");
  eputs("\r\n@@  @@          @@  @@\r\n");
  eputs("\r\n      @@@@  @@@@      \r\n");
}
static void makeBackground(int starCount) {
  randState = milliseconds;
  for (uint16_t i = 0; i < starCount; ++i) {
    uint16_t x = (uint16_t)(xorshift32() % SCREEN_W);
    uint16_t y = (uint16_t)(xorshift32() % SCREEN_H);

    // uint16_t x = (uint16_t)(xorshift32() % SCREEN_W);
    // uint16_t y = (uint16_t)(xorshift32() % SCREEN_H);

    int r = xorshift32() % 3;
    // int r = xorshift32() % 3;
    uint16_t colour;
    if (r == 0) {
      colour = STAR_RED;
    } else if (r == 1) {
      colour = STAR_BLUE;
    } else {
      colour = STAR_WHITE;
    }

    putPixel(x, y, colour);
  }
}

/*
Splash screen with loading bar
*/
static void splashScreen() {
  // Clear display as precaution
  clearDisplay();

  // Create the starry background
  // makeBackground(30);
  loadBackground();

  // Create loadedBit variable to make the amount of bit variables there will be
  // (Make it progress smoothly)
  const int loadedBit = 50;
  // Pixels loaded per individual loaded bit
  const uint16_t bitWidth = LBAR_W / loadedBit;
  // delay until three seconds
  const uint16_t delayMs = 3000 / loadedBit;

  // Draw the bar background
  drawRectangle(LBAR_X, LBAR_Y, LBAR_W, LBAR_H, LBAR_BACKGROUND);

  printText("LOADING...", 30, LBAR_Y - 10, STAR_WHITE, 0);
  // Animate the filling of the background
  for (int i = 0; i <= loadedBit; i++) {
    /* Corner Button ==>  Main Menu  // PA9*/

    if ((GPIOA->IDR & (1 << 9)) == 0) {
      return;
    }
    int w = i * bitWidth;

    // Draw the filled percentage
    fillRectangle(LBAR_X, LBAR_Y, w, LBAR_H, LBAR_FILL);
    // Delay to make look like loading
    delay(delayMs);
  }
}

/* --- Game initialisation / reset ----------------------------------------- */
static void parkAlienBullet(int col) {
  AlienGrid* ag = &gs.aliens;
  Bullet* b = &ag->ab[col];

  // find the bottom alive alien in the column

  int row = -1;
  for (int i = ALIEN_ROWS - 1; i >= 0; i--) {
    if (ag->status[i][col] == 0) {
      row = i;
      break;
    }
  }

  // no
  if (row == -1) {
    b->state = BULLET_READY;
    return;
  }

  b->coords.x = b->coords.oldX =
      (uint16_t)(ag->offsetX + ag->basePosX[col] + BULLET_OFFSET_X);
  b->coords.y = b->coords.oldY =
      (uint16_t)(ag->offsetY + ag->basePosY[row] + ALIEN_H);

  b->speed = ALIEN_BULLET_SPEED;
  b->state = BULLET_READY;
}
static void initAlienGrid() {
  AlienGrid* ag = &gs.aliens;
  ag->offsetX = ag->oldOffsetX = ALIEN_ORIGIN_X;
  ag->offsetY = ag->oldOffsetY = ALIEN_ORIGIN_Y;
  ag->dirX = -1;
  ag->earToggle = 0;
  ag->lastMoveTime = 0;

  ag->respawning = 0;
  ag->previewVisible = 0;
  ag->flashStep = 0;
  ag->redrawAll = 1;
  ag->respawnTimer = 0;

  for (int i = 0; i < ALIEN_ROWS; i++)
    ag->basePosY[i] = (uint16_t)(i * (ALIEN_H + ALIEN_GAP_Y));
  for (int j = 0; j < ALIEN_COLS; j++)
    ag->basePosX[j] = (uint16_t)(j * (ALIEN_W + ALIEN_GAP_X));

