CDiamondGit/stm32SpaceInvaders/src/main.c
      if (selectedOption < 3) {
        selectedOption++;
        delay(100);
      }
    }

    if (((GPIOA->IDR & (1 << 8)) == 0) || c == 'w' || c == 'W') {
      while ((GPIOA->IDR & (1 << 11)) == 0)
        ; /* wait for release */
      delay(50);
      if (selectedOption > 0) {
        selectedOption--;
        delay(100);
      }
    }

    if (((GPIOB->IDR & (1 << 4)) == 0) || c == ' ' || c == '\r' || c == '\n' ||
        c == 'd' || c == 'D') {
      if (selectedOption == 0) {
        *as = PLAYING;
        done = 1;
      }
      if (selectedOption == 1) {
        *as = HELP;
        done = 1;
      }
      if (selectedOption == 2) {
        *as = RECORD;
        done = 1;
      }
      if (selectedOption == 3) {
        *as = MODE;
        done = 1;
      }
    }
  }
}
void help(AppState* as) {
  clearDisplay();

  int done = 0;

  while (!done) {
    char c = 0;
    if (serialCharAvailable()) {
      c = serialGetCharNonBlocking();
    }

    printTextX2("HELP", 40, 0, RGBToWord(255, 255, 0), 0);

    printText("Control spaceship:", 0, 20, RGBToWord(255, 255, 255), 0);
    printText("Left/Right buttons", 0, 30, RGBToWord(255, 255, 255), 0);
    printText("FIRE = UP BUTTON", 0, 60, RGBToWord(255, 255, 255), 0);
    printText("PAUSE = DOWN BUTTON", 0, 80, RGBToWord(255, 255, 255), 0);

    printText("EXIT HELP = DOWN BUTTON", 0, 120, RGBToWord(255, 255, 255), 0);

    if (((GPIOA->IDR & (1 << 11)) == 0) || c == 's' || c == 'S' || c == '\r' ||
        c == '\n') {
      *as = MAINMENU;
      done = 1;
    }
  }
}
void selectMode(AppState* as, GameMode* gm) {
  clearDisplay();

  loadBackground();
  printText("Game Level:", 20, 40, 65535, 0);

  int selectedOption = *gm;

  uint16_t normal = RGBToWord(0xff, 0xff, 0);
  uint16_t highlighted = RGBToWord(211, 211, 211);
  uint16_t startButton = normal;
  uint16_t helpButton = normal;
  uint16_t scoreButton = normal;

  while (1) {
    char c = 0;
    if (serialCharAvailable()) {
      c = serialGetCharNonBlocking();
    }

    if (selectedOption == 0) {
      startButton = highlighted;
      helpButton = normal;
      scoreButton = normal;
    }
    if (selectedOption == 1) {
      helpButton = highlighted;
      scoreButton = normal;
      startButton = normal;
    }
    if (selectedOption == 2) {
      scoreButton = highlighted;
      startButton = normal;
      helpButton = normal;
    }

    printText("Easy", 20, 60, startButton, 0);
    printText("Medium", 20, 80, helpButton, 0);
    printText("Hard", 20, 100, scoreButton, 0);

    if (((GPIOA->IDR & (1 << 11)) == 0) || c == 's' || c == 'S') {
      if (selectedOption < 2) {
        selectedOption++;
        delay(200);
      }
    }

    if (((GPIOA->IDR & (1 << 8)) == 0) || c == 'w' || c == 'W') {
      if (selectedOption > 0) {
        selectedOption--;
        delay(200);
      }
    }

    if (((GPIOB->IDR & (1 << 4)) == 0) || c == ' ' || c == '\r' || c == '\n' ||
        c == 'd' || c == 'D') {
      if (selectedOption == 0) {
        *gm = EASY;
        *as = MAINMENU;
        return;
      }
      if (selectedOption == 1) {
        *gm = MEDIUM;
        *as = MAINMENU;
        return;
      }
      if (selectedOption == 2) {
        *gm = HARD;
        *as = MAINMENU;
        return;
      }

      delay(200);
    }
  }
}
void showScoreBoard(AppState* as) {
  clearDisplay();

  /* --- Heading ---------------------------------------------------------- */
  uint16_t headingColor = RGBToWord(255, 215, 0);  /* gold              */
  uint16_t normalColor = RGBToWord(255, 255, 255); /* white             */
  uint16_t topColor = RGBToWord(255, 215, 0);      /* gold for top score*/
  uint16_t rowColor = RGBToWord(180, 180, 180);    /* grey for rest     */

  printTextBold("SCOREBOARD", 5, 5, headingColor, 0);

  /* --- Divider ---------------------------------------------------------- */
  drawLine(0, 20, SCREEN_W, 20, headingColor);

  /* --- Column headers --------------------------------------------------- */
  printText("NAME", 10, 26, normalColor, 0);
  printText("SCORE", 80, 26, normalColor, 0);
  drawLine(0, 35, SCREEN_W, 35, RGBToWord(80, 80, 80));

  /* --- Rows ------------------------------------------------------------- */
  for (int i = 0; i < MAX_RECORDS; i++) {
    uint16_t y = (uint16_t)(42 + i * 18);
    uint16_t color = (i == 0) ? topColor : rowColor;

    char number = (i + 1) + '0';
    char index[2] = {number, '\0'};

    /* Rank number */
    printText(index, 1, y, color, 0);
    printText(".", 8, y, color, 0);

    /* Initials */
    printText(records[i].initials, 18, y, color, 0);

    /* Score – right aligned at x=80 */
    printNumber(records[i].score, 80, y, color, 0);

    /* Underline each row */
    drawLine(0, (uint16_t)(y + 12), SCREEN_W, (uint16_t)(y + 12),
             RGBToWord(40, 40, 40));
  }

  /* --- Footer ----------------------------------------------------------- */
  drawLine(0, 148, SCREEN_W, 148, headingColor);
  printText("DOWN to go back", 10, 152, RGBToWord(100, 100, 100), 0);

  /* --- Wait for down button to exit ------------------------------------- */
  while ((GPIOA->IDR & (1 << 11)) != 0)
    ; /* wait for press  */
  delay(50);
  while ((GPIOA->IDR & (1 << 11)) == 0)
    ; /* wait for release */
  delay(50);

  *as = MAINMENU;

  return;
}
void getPause(PlayingState* ps, AppState* as) {
  uint16_t pinkColor = RGBToWord(255, 20, 147);

  int selected = 0; /* 0 = Resume, 1 = Main Menu */
  if (*ps == GAMEOVER) {
    clearDisplay();
    printTextBold("GAMEOVER!!", 5, 10, RGBToWord(255, 255, 0), 0);

    ScoreRecord newEntry;
    char alpha = 'A';
    char alphaStr[2] = {alpha, '\0'};
    int position = 0;
    char initials[4] = {'_', '_', '_', '\0'};

    if (gs.score > gs.highScore) {
      printText("New Highscore", 20, 22, RGBToWord(255, 255, 255), 0);
      printTextX2(initials, 50, 40, RGBToWord(255, 255, 0), 0);
      printTextX2("<", 40, 60, pinkColor, 0);
      printTextX2(alphaStr, 60, 60, pinkColor, 0);
      printTextX2(">", 80, 60, pinkColor, 0);

      printText("< > : Navigate", 10, 92, RGBToWord(255, 255, 255), 0);
      printText("UP : Select", 10, 102, RGBToWord(255, 255, 255), 0);
      printText("Corner : Reset", 10, 112, RGBToWord(255, 255, 255), 0);

      printText("Press down key", 10, 125, RGBToWord(255, 255, 255), 0);
      printText("To save and exit", 10, 135, RGBToWord(255, 255, 255), 0);

      while (1) {
        char c = '0';

        if (serialCharAvailable()) {
          c = serialGetCharNonBlocking();
        }

        if (!(GPIOA->IDR & (1 << 11)) ||
            (c == '\r' || c == '\n')) {  // down key to save and exit
          /* Quit to main menu */

