CDiamondGit/stm32SpaceInvaders/src/main.c
    updateMainAlienBulletCollision();
    moveMainAlien(&gs.mysteryAlien);

    AlienGrid* ag = &gs.aliens;

    if (!ag->respawning) {
      for (int j = 0; j < ALIEN_COLS; j++) {
        Bullet* b = &ag->ab[j];
        if (b->state == BULLET_FIRE) {
          b->coords.y += b->speed; /* alien bullets go DOWN */
          if (b->coords.y > HUD_LINE_Y - 5)
            resetAlienBullet(j);
        }
      }

      moveAliens(now);
      updateAlienFire(now);
      updatePlayerCollision();
    } else {
      updateAlienRespawn(now);
    }

    if (updateAlienBulletCollision()) {
      // stop_sound_effect_ch2();
      gs.lives -= 1;
      putImage(gs.ship.coords.x, gs.ship.coords.y, ALIEN_W, ALIEN_H, explosion,
               1, 0);
      // delay(200);
      start_sound_effect_ch1(lose_life_notes, lose_life_times,
                             lose_life_note_count, 0);

      delay(350);

      resetGame();

      continue;
    }

    if (checkGameOver()) {
      gs.lives -= 1;
      currentPlayingState = GAMEOVER;
      lightLivesIndicator(gs.lives);
      stop_sound_effect_ch1();
      stop_sound_effect_ch2();
      renderGameOverScreen(&currentPlayingState, as);
      continue;
    }

    renderScene(); /* positions -> screen           */
    lightLivesIndicator(gs.lives);
  }
}

/* --- Input handling ------------------------------------------------------ */
static void handleInput(PlayingState* ps, AppState* as) {
  char c = 0;

  if (serialCharAvailable()) {
    c = serialGetCharNonBlocking();
  }

  if (c != 0) {
    eputchar(c);
    eputchar('\r');
    eputchar('\n');
  }

  /* Right – PB4 or D */
  if (((GPIOB->IDR & (1 << 4)) == 0) || (c == 'd') || (c == 'D')) {
    if (gs.ship.coords.x < SHIP_MAX_X)
      gs.ship.coords.x += gs.ship.speed;
  }

  /* Left – PB5 or A */
  if (((GPIOB->IDR & (1 << 5)) == 0) || (c == 'a') || (c == 'A')) {
    if (gs.ship.coords.x > SHIP_MIN_X)
      gs.ship.coords.x -= gs.ship.speed;
  }

  /* Fire – PA8 or SPACE or W */
  if (((GPIOA->IDR & (1 << 8)) == 0) || (c == ' ') || (c == 'w') ||
      (c == 'W')) {
    if (gs.bullet.state == BULLET_READY) {
      gs.bullet.state = BULLET_FIRE;
      start_sound_effect_ch1(shoot_notes, shoot_times, shoot_note_count, 0);
      // delay(50);
    }
  }

  /* Pause - PA11 or D*/
  if ((GPIOA->IDR & (1 << 11)) == 0 || (c == 'S') || (c == 's')) {
    delay(50);
    *ps = PAUSE;
  }

  /* Corner Button ==>  Main Menu  // PA9*/

  if ((GPIOA->IDR & (1 << 9)) == 0) {
    delay(50);
    *ps = PAUSE;
    stop_sound_effect_ch2();
    stop_sound_effect_ch1();
    *as = MAINMENU;
  }
}

/* --- Alien movement / firing --------------------------------------------- */
static int isAlienGridMt(void) {
  AlienGrid* ag = &gs.aliens;
  for (int i = 0; i < ALIEN_ROWS; i++) {
    for (int j = 0; j < ALIEN_COLS; j++) {
      if (ag->status[i][j] == 0) {
        return 0;
      }
    }
  }
  return 1;
}
static uint16_t getLowestAlienY(void) {
  AlienGrid* ag = &gs.aliens;
  for (int i = ALIEN_ROWS - 1; i >= 0; i--) {
    for (int j = 0; j < ALIEN_COLS; j++) {
      if (ag->status[i][j] == 0) {
        // lowest alive alien Y position
        return (uint16_t)(ag->offsetY + ag->basePosY[i] + ALIEN_H);
      }
    }
  }

  return 0;  // no-alien alive.
}
static void moveAliens(uint32_t now) {
  AlienGrid* ag = &gs.aliens;

  // Stop movement while respawning
  if (ag->respawning)
    return;

  // If all aliens are gone, start respawn sequence
  if (isAlienGridMt()) {
    startAlienRespawn();
    return;
    // stop_sound_effect_ch2();  // stop music briefly
    // start_sound_effect_ch1(game_win_notes_ch1, game_win_times_ch1,
    //                        game_win_note_count_ch1, 0);
    // start_sound_effect_ch2(game_win_notes_ch2, game_win_times_ch2,
    //                        game_win_note_count_ch2, 0);
    // delay(900);  // let win jingle finish (4 x 200ms + buffer)
    // start_sound_effect_ch2(game_loop_notes, game_loop_times,
    //                        game_loop_note_count, 1);
    // initAlienGrid();
  }

  // Control movement speed (frame timing)
  if (now - ag->lastMoveTime < gs.alienSpeed)
    return;
  ag->lastMoveTime = now;

  ag->oldOffsetX = ag->offsetX;
  ag->oldOffsetY = ag->offsetY;

  int16_t nextX = ag->offsetX + (ALIEN_STEP * ag->dirX);
  ag->earToggle = !ag->earToggle;

  if (nextX < ALIEN_MIN_X || nextX > ALIEN_MAX_X) {
    /* Hit a wall: drop down, reverse direction, no horizontal step */

    // Random fire on wall hit
    // TODO: move this to a timed system instead of per wall hit
    for (int j = 0; j < ALIEN_COLS; j++) {
      if (ag->ab[j].state == BULLET_READY && shouldFire(12))
        ag->ab[j].state = BULLET_FIRE;
    }
    ag->offsetY += ALIEN_DROP;
    ag->dirX *= -1;
  } else {
    ag->offsetX = nextX;
  }

  for (int j = 0; j < ALIEN_COLS; j++) {
    if (ag->ab[j].state == BULLET_READY)
      parkAlienBullet(j);
  }
}
static void updateAlienFire(uint32_t now) {
  AlienGrid* ag = &gs.aliens;
  for (int j = 0; j < ALIEN_COLS; j++) {
    if (ag->ab[j].state != BULLET_READY)
      continue; /* already in flight */

    int hasAlive = 0;
    for (int i = 0; i < ALIEN_ROWS; i++)
      if (ag->status[i][j] == 0) {
        hasAlive = 1;
        break;
      }
    if (!hasAlive)
      continue;

    if (now >= ag->nextFireTime[j]) {
      ag->ab[j].state = BULLET_FIRE;
      ag->nextFireTime[j] = now + randomFireDelay();
    }
  }
}
static void moveMainAlien(MainAlien* ma) {
  uint32_t now = milliseconds;

  /* --- Spawn logic --- */
  if (!ma->active) {
    if (now >= ma->nextSpawnTime) {
      ma->active = 1;

      if (!sound_effect_ch1_busy()) 
      {
        start_sound_effect_ch1(aliens_spawning_notes, aliens_spawning_times,aliens_spawning_note_count, 0);
      }

      /* Random direction */
      if (xorshift32() & 1) {
        ma->dir = 1;
        ma->coords.x = 0;
      } else {
        ma->dir = -1;
        ma->coords.x = SCREEN_W - MAIN_ALIEN_W;
      }

      ma->coords.y = MAIN_ALIEN_Y;
      ma->coords.oldX = ma->coords.x;
      ma->coords.oldY = ma->coords.y;

