CDiamondGit/stm32SpaceInvaders/src/main.c
      ma->lastMoveTime = now;
    }
    return;
  }

  /* --- Movement timing --- */
  if (now - ma->lastMoveTime < MAIN_ALIEN_MOVE_DELAY)
    return;

  ma->lastMoveTime = now;

  /* --- Erase old position --- */
  fillRectangle(ma->coords.oldX, ma->coords.oldY, MAIN_ALIEN_W, MAIN_ALIEN_H,
                0);

  /* --- Move --- */
  ma->coords.oldX = ma->coords.x;
  ma->coords.x += ma->speed * ma->dir;

  /* --- Draw --- */
  putImage(ma->coords.x, ma->coords.y, MAIN_ALIEN_W, MAIN_ALIEN_H, mainAlienSpr,
           1, 0);

  /* --- Check bounds --- */
  if (ma->coords.x <= 0 || ma->coords.x >= (SCREEN_W - MAIN_ALIEN_W)) {
    /* erase before disappearing */
    fillRectangle(ma->coords.x, ma->coords.y, MAIN_ALIEN_W, MAIN_ALIEN_H, 0);

    ma->active = 0;
    ma->nextSpawnTime = now + randomMainAlienDelay();
  }
}

/* --- Collision / bullet state -------------------------------------------- */
static int checkCollision(uint16_t o1X, uint16_t o1Y, uint16_t o1w, uint16_t o1h, uint16_t o2X, uint16_t o2Y, uint16_t o2w, uint16_t o2h) {
  if (o1X + o1w <= o2X)
    return 0;
  if (o1X >= o2X + o2w)
    return 0;
  if (o1Y + o1h <= o2Y)
    return 0;
  if (o1Y >= o2Y + o2h)
    return 0;
  return 1;
}
/*
Alien bullet reset
*/
static void resetAlienBullet(int col) {
  AlienGrid* ag = &gs.aliens;
  Bullet* b = &ag->ab[col];
  /* Erase both positions */
  fillRectangle(b->coords.x, b->coords.y, BULLET_W, BULLET_H, 0);
  fillRectangle(b->coords.oldX, b->coords.oldY, BULLET_W, BULLET_H, 0);
  parkAlienBullet(col);
}
/*
Player Bullet Reset
*/
static void resetPlayerBullet(void) {
  Bullet* b = &gs.bullet;
  gs.bullet.state = BULLET_READY;

  fillRectangle(b->coords.oldX, b->coords.oldY, BULLET_W, BULLET_H + 5, 0);

  gs.bullet.coords.x = gs.bullet.coords.oldX =
      gs.ship.coords.x + BULLET_OFFSET_X;
  gs.bullet.coords.y = gs.bullet.coords.oldY =
      gs.ship.coords.y - BULLET_OFFSET_Y;
}
static void repairAliensUnderRect(uint16_t rx, uint16_t ry, uint16_t rw, uint16_t rh) {
  AlienGrid* ag = &gs.aliens;
  for (int i = 0; i < ALIEN_ROWS; i++) {
    for (int j = 0; j < ALIEN_COLS; j++) {
      if (ag->status[i][j] != 0)
        continue;
      uint16_t ax = (uint16_t)(ag->offsetX + ag->basePosX[j]);
      uint16_t ay = (uint16_t)(ag->offsetY + ag->basePosY[i]);
      if (checkCollision(ax, ay, ALIEN_W, ALIEN_H, rx, ry, rw, rh)) {
        /* Which sprite to use for this row */
        const uint16_t* spr = (i == 0)   ? redAlien[ag->earToggle]
                              : (i == 1) ? greenAlien[ag->earToggle]
                                         : blueAlienBoth[ag->earToggle];
        putImage(ax, ay, ALIEN_W, ALIEN_H, spr, 1, 0);
      }
    }
  }
}
static int updateAlienBulletCollision(void) {
  AlienGrid* ag = &gs.aliens;
  int hit = 0;
  for (int j = 0; j < ALIEN_COLS; j++) {
    Bullet* b = &ag->ab[j];
    if (b->state != BULLET_FIRE)
      continue;
    if (checkCollision(gs.ship.coords.x, gs.ship.coords.y, SHIP_W, SHIP_H,
                       b->coords.x, b->coords.y, BULLET_W, BULLET_H)) {
      resetAlienBullet(j);
      hit = 1;
    }
  }
  return hit;
}
static void updateMainAlienBulletCollision(void) {
  MainAlien* ma = &gs.mysteryAlien;
  Bullet* b = &gs.bullet;
  if (b->state != BULLET_FIRE)
    return;

  if (checkCollision(ma->coords.x, ma->coords.y, MAIN_ALIEN_W, MAIN_ALIEN_H,
                     b->coords.x, b->coords.y, BULLET_W, BULLET_H)) {
    gs.score += 50;
    fillRectangle(ma->coords.x, ma->coords.y, MAIN_ALIEN_W, MAIN_ALIEN_H, 0);
    putImage(ma->coords.x, ma->coords.y, ALIEN_W, ALIEN_H, explosion, 1, 0);
    start_sound_effect_ch1(explode_notes, explode_times, explode_note_count, 0);
    delay(100);
    fillRectangle(ma->coords.x, ma->coords.y, ALIEN_W, ALIEN_H, 0);
    start_sound_effect_ch1(explode_notes, explode_times, explode_note_count, 0);

    initMainAlien(&gs.mysteryAlien);
  }
}
static void updatePlayerCollision(void) {
  if (gs.bullet.state != BULLET_FIRE)
    return;

  AlienGrid* ag = &gs.aliens;
  for (int i = 0; i < ALIEN_ROWS; i++) {
    for (int j = 0; j < ALIEN_COLS; j++) {
      if (ag->status[i][j] != 0)
        continue; /* already dead */

      /* Absolute screen position = grid origin + relative cell offset */
      uint16_t ax = (uint16_t)(ag->offsetX + ag->basePosX[j]);
      uint16_t ay = (uint16_t)(ag->offsetY + ag->basePosY[i]);

      if (checkCollision(ax, ay, ALIEN_W, ALIEN_H, gs.bullet.coords.x,
                         gs.bullet.coords.y, BULLET_W, BULLET_H)) {
        putImage(ax, ay, ALIEN_W, ALIEN_H, explosion, 1, 0);
        delay(50);
        fillRectangle(ax, ay, ALIEN_W, ALIEN_H, 0);

        ag->status[i][j] = 1;
        start_sound_effect_ch1(explode_notes, explode_times, explode_note_count,
                               0);

        /* Park the alien bullet for this column (shooter is dead) */
        resetAlienBullet(j);
        resetPlayerBullet();

        /* Increase the score..... */

        gs.score += gs.score_inc;
        return; /* one hit per frame */
      }
    }
  }
}
static int checkGameOver(void) {
  uint16_t lowestY = getLowestAlienY();

  if (gs.lives == 0) {
    return 1;
  }

  if (lowestY == 0)
    return 0; /* no aliens left - nothing to check */

  /* Condition 1: aliens reached the HUD line */
  if (lowestY >= HUD_LINE_Y)
    return 1;

  /* Condition 2: any alive alien overlaps the ship */
  AlienGrid* ag = &gs.aliens;
  for (int i = 0; i < ALIEN_ROWS; i++) {
    for (int j = 0; j < ALIEN_COLS; j++) {
      if (ag->status[i][j] != 0)
        continue;
      uint16_t ax = (uint16_t)(ag->offsetX + ag->basePosX[j]);
      uint16_t ay = (uint16_t)(ag->offsetY + ag->basePosY[i]);
      if (checkCollision(ax, ay, ALIEN_W, ALIEN_H, gs.ship.coords.x,
                         gs.ship.coords.y, SHIP_W, SHIP_H))
        return 1;
    }
  }
  for (int j = 0; j < ALIEN_COLS; j++) {
    Bullet* b = &ag->ab[j];
    if (b->state != BULLET_FIRE)
      continue;
    if (checkCollision(gs.ship.coords.x, gs.ship.coords.y, SHIP_W, SHIP_H,
                       b->coords.x, b->coords.y, BULLET_W, BULLET_H))
      return 1;
  }
  return 0;
}

/* --- Rendering ----------------------------------------------------------- */
/*
 * renderAliens - full grid redraw.
 * Used at startup, level reset, and after every move tick.
 *
 * On a move tick the dirty-strip strategy is used:
 *   1. Erase the vacated edge strip (one fillRectangle call).
 *   2. Blit only alive aliens - dead cells stay black automatically
 *      because the strip erase already cleared them.
 */
static void renderAliens(void) {
  AlienGrid* ag = &gs.aliens;

