CDiamondGit/stm32SpaceInvaders/src/main.c
  /* Nothing changed this frame - skip entirely */
  if (!ag->redrawAll && !ag->respawning && ag->offsetX == ag->oldOffsetX &&
      ag->offsetY == ag->oldOffsetY)
    return;

  /* 1. Erase the full bounding box at the OLD position */
  if (ag->redrawAll || ag->respawning) {
    fillRectangle((uint16_t)ag->offsetX, (uint16_t)ag->offsetY, ALIEN_GRID_W,
                  ALIEN_GRID_H, 0);
  } else {
    fillRectangle((uint16_t)ag->oldOffsetX, (uint16_t)ag->oldOffsetY,
                  ALIEN_GRID_W, ALIEN_GRID_H, 0);
  }

  /* 2. Blit alive aliens at the NEW position */
  for (int i = 0; i < ALIEN_ROWS; i++) {
    for (int j = 0; j < ALIEN_COLS; j++) {
      if (ag->respawning) {
        if (ag->previewVisible && ag->nextStatus[i][j] == 0) {
          putImage((uint16_t)(ag->offsetX + ag->basePosX[j]),
                   (uint16_t)(ag->offsetY + ag->basePosY[i]), ALIEN_W, ALIEN_H,
                   respawn_flicker, 1, 0);
        }
        continue;
      }

      if (ag->status[i][j] != 0)
        continue;

      if (i == 0) {
        putImage((uint16_t)(ag->offsetX + ag->basePosX[j]),
                 (uint16_t)(ag->offsetY + ag->basePosY[i]), ALIEN_W, ALIEN_H,
                 redAlien[ag->earToggle], 1, 0);
      }
      if (i == 1) {
        putImage((uint16_t)(ag->offsetX + ag->basePosX[j]),
                 (uint16_t)(ag->offsetY + ag->basePosY[i]), ALIEN_W, ALIEN_H,
                 greenAlien[ag->earToggle], 1, 0);
      }
      if (i >= 2) {
        putImage((uint16_t)(ag->offsetX + ag->basePosX[j]),
                 (uint16_t)(ag->offsetY + ag->basePosY[i]), ALIEN_W, ALIEN_H,
                 blueAlienBoth[ag->earToggle], 1, 0);
      }
    }
  }

  ag->oldOffsetX = ag->offsetX;
  ag->oldOffsetY = ag->offsetY;
  ag->redrawAll = 0;
}
/*
Dirty-rect ship: erase only the vacated edge strip
*/
static void renderShip(void) {
  if (gs.ship.coords.oldX == gs.ship.coords.x &&
      gs.ship.coords.oldY == gs.ship.coords.y)
    return;

  int16_t dx = (int16_t)gs.ship.coords.x - gs.ship.coords.oldX;

  if (dx > 0)
    fillRectangle(gs.ship.coords.oldX, gs.ship.coords.oldY, (uint16_t)dx,
                  SHIP_H, 0);
  else if (dx < 0)
    fillRectangle(gs.ship.coords.x + SHIP_W, gs.ship.coords.oldY,
                  (uint16_t)(-dx), SHIP_H, 0);

  gs.ship.coords.oldX = gs.ship.coords.x;
  gs.ship.coords.oldY = gs.ship.coords.y;
  putImage(gs.ship.coords.x, gs.ship.coords.y, SHIP_W, SHIP_H, spaceShip, 1, 0);
}
/*
Erase tail strip only, draw new bullet head
*/
static void renderPlayerBullet(void) {
  if (gs.bullet.state != BULLET_FIRE)
    return;

  Bullet* b = &gs.bullet;
  fillRectangle(b->coords.oldX, b->coords.oldY + BULLET_H, BULLET_W, b->speed,
                0);
  b->coords.oldX = b->coords.x;
  b->coords.oldY = b->coords.y;
  fillRectangle(b->coords.x, b->coords.y, BULLET_W, BULLET_H, BULLET_COLOR);
}
static void renderAlienBullets(void) {
  AlienGrid* ag = &gs.aliens;
  for (int j = 0; j < ALIEN_COLS; j++) {
    Bullet* b = &ag->ab[j];
    if (b->state != BULLET_FIRE)
      continue;

    /* 1. Erase old position */
    fillRectangle(b->coords.oldX, b->coords.oldY, BULLET_W, BULLET_H, 0);

    /* 2. Repair aliens whose pixels the erase may have destroyed */
    repairAliensUnderRect(b->coords.oldX, b->coords.oldY, BULLET_W, BULLET_H);

    /* 3. Draw bullet at new position */
    b->coords.oldX = b->coords.x;
    b->coords.oldY = b->coords.y;
    fillRectangle(b->coords.x, b->coords.y, BULLET_W, BULLET_H,
                  ALIEN_BULLET_COLOR);
  }
}
static void renderGameOverScreen(PlayingState* ps, AppState* as) {
  getPause(ps, as);
}
static void renderStats(void) {
  printText("S:", 83, HUD_LINE_Y + 5, RGBToWord(128, 0, 128), 0);
  printNumber((uint16_t)gs.score, 95, HUD_LINE_Y + 5, RGBToWord(128, 0, 128),

              0);
  printText("HS:", 2, HUD_LINE_Y + 5, RGBToWord(128, 0, 128), 0);
  printNumber((uint16_t)gs.highScore, 22, HUD_LINE_Y + 5,
              RGBToWord(128, 0, 128), 0);
}
/*
Top-level render dispatcher
*/
static void renderScene(void) {
  renderAliens(); /* no-op internally if grid didn't move this frame */
  renderShip();
  renderPlayerBullet();
  renderAlienBullets();
  renderStats();
}